[
  {
    "title": "Банк Зенит",
    "src": "https://zzcash.net/img/logo/zzcash/ru/Банк%20Зенит%20Кредит.png",
    "description": "Разработка сервиса взаимодействия с \"Расчетно кредитным конвеером\" банка для осуществления процедуры займа",
    "technologies": [
      "react",
      "redux",
      "typescript"
    ],
    "content": "<div><div>Разработка личного кабинета заемщика и кредитного приложения для банка “Зенит”.</div><div>Данный проект был проинициализирован мной в соответствии с требованиями заказчика и договоренностями внутри команды. Реализовал UI авторизации пользователя (в том числе через Госуслуги), процедуры займа, работы с документами, взаимодействия с расчетно-кредитным калькулятором, а также мониторинга статуса заявки. Разработал адаптивное представление для мобильной версии приложения. По согласованию с командой, осуществил перевод проекта с чистого JavaScript на TypeScript.</div><br/><div><strong>Обязанности:</strong><span> Разработка клиентской части личного кабинета заемщика.</span></div><div><strong>Используемые технологии:</strong><span> React, Redux, TypeScript.</span></div></div>"
  },
  {
    "title": "Банк Уралсиб",
    "src": "https://s0.rbk.ru/rbcplus_pics/media/img/2/55/805270558862552.jpg",
    "description": "Разработка клиентской части электронного архива для сотрудников банка",
    "technologies": [
      "react",
      "redux",
      "typescript"
    ],
    "content": "<div><div>Разработка электронного архива для банка “УралСиб”.</div><div>Проект представляет собой приложение для управления данными юридических и физических лиц. В приложении реализовал UI и функционал работы с юридическими лицами, а также функционал администрирования документов, справочников и продуктов банка. Создал несколько режимов отображения приложения, позволяющих запускать его как отдельно, так и в iframe внутри корпоративной оболочки платформы банка.</div><br/><div><strong>Обязанности:</strong><span> Разработка клиентской части личного кабинета заемщика.</span></div><div><strong>Используемые технологии:</strong><span> React, Redux, TypeScript.</span></div></div>"
  },
  {
    "title": "Micargo",
    "src": null,
    "description": "Разработка клиентской части для сервиса страхования грузоперевозок США - Канада",
    "technologies": [
      "react",
      "redux",
      "typescript"
    ],
    "content": "<div><div>Сервис для страхования грузоперевозок США - Канада.</div><div>Состоит из нескольких частей: приобретение страховой декларации, профиль пользователя, история покупок, раздел жалоб, раздел отмены оплаченной декларации, статичные страницы.</div><div>Разработка на ТypeScript с использованием библиотеки React. В качестве стейт менеджера использован Redux, для авторизации применен JSON Web Token (JWT), который передается на сервер при запросе в интерцепторах. Для маршрутизации использован React-router-dom.</div><div>Все SPA имеют разный функционал в зависимости от статуса пользователя (гость, пользователь, администратор). Для реализации повторяющихся компонентов применен паттерн Higher-Order Component (HOC), позволяющий многократное переиспользование и исключающий дублирования кода. В качестве стилевой UI библиотеки использован React-Bootstrap. </div><div>Для наиболее легкого взаимодействия с сервисом в проекте реализован многослойный функционал. Все поля учтены и провалидированы с помощью библиотеки Formik. Для использования масок ввода (поля номера телефона, цены и данные банковских карт) применена библиотека react-text-mask. Для реализации нестандартных требований пользовательского ввода даты применялся react-datepicker, во избежание потери данных пользовательской сессии учтен вариант перезагрузки страницы с сохранением данных в local/sessionStorage. Также через CSS при помощи Styled Components реализованы кастомные UI компоненты для многоцелевого использования, такие как: ProgressBar, нестандартные селекты, чекбоксы, радио баттоны, различные анимации. Платежная система на клиенте реализована с помощью библиотеки react-credit-cards, в которую встроена анимационная кредитная карта. Сохранение сформированной документации в формате PDF реализовано с помощью модуля file-saver. По вводимому индексу реализовано определение адреса пункта отправки и назначения через google-api с графическим отображением маршрута перевозки на карте (реализовано через google-maps-react). Все запросы на сервер отправлялись при использовании Axios.</div><br/><div><strong>Обязанности:</strong><span> Разработка клиентской части личного кабинета заемщика.</span></div><div><strong>Используемые технологии:</strong><span> React, Redux, TypeScript.</span></div></div>"
  }
]